oscillatingElasticBeam/constant/fluid/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
//Level 0	
    (0 0 0)//0
    (1.4 0 0)//1
    (1.45 0 0)//2
    (3.05 0 0)//3
    (3.05 0 -1)//4
    (1.45 0 -1)//5
    (1.4 0 -1)//6
    (0 0 -1)//7
    (0 0 -2)//8
    (1.4 0 -2)//9
    (1.45 0 -2)//10
    (3.05 0 -2)//11
//Level 1	
    (0 0.2 0)//12
    (1.4 0.2 0)//13
    (1.45 0.2 0)//14
    (3.05 0.2 0)//15
    (3.05 0.2 -1)//16
    (1.45 0.2 -1)//17
    (1.4 0.2 -1)//18
    (0 0.2 -1)//19
    (0 0.2 -2)//20
    (1.4 0.2 -2)//21
    (1.45 0.2 -2)//22
    (3.05 0.2 -2)//23
//Level 2	
    (0 1 0)//24
    (1.4 1 0)//25
    (1.45 1 0)//26
    (3.05 1 0)//27
    (3.05 1 -1)//28
    (1.45 1 -1)//29
    (1.4 1 -1)//30
    (0 1 -1)//31
    (0 1 -2)//32
    (1.4 1 -2)//33
    (1.45 1 -2)//34
    (3.05 1 -2)//35
//Level 4	
    (0 -0.2 0)		//36 	//0	//12	//24          
    (1.4 -0.2 0)	//37 	//1	//13	//25
    (1.45 -0.2 0)	//38 	//2	//14	//26
    (3.05 -0.2 0)	//39 	//3	//15	//27
    (3.05 -0.2 -1)	//40 	//4	//16	//28
    (1.45 -0.2 -1)	//41	//5	//17	//29
    (1.4 -0.2 -1)	//42	//6	//18	//30
    (0 -0.2 -1)	//43   //7	//19	//31
    (0 -0.2 -2)	//44   //8	//20	//32
    (1.4 -0.2 -2)	//45	//9 	//21	//33
    (1.45 -0.2 -2)	//46	//10	//22	//34
    (3.05 -0.2 -2)	//47 	//11 	//23	//35
//Level 5	
    (0 -1 0)		//48  	//0	//12	//24
    (1.4 -1 0)	//49  	//1	//13	//25
    (1.45 -1 0)	//50  	//2	//14	//26
    (3.05 -1 0)	//51   	//3	//15	//27
    (3.05 -1 -1)	//52 	//4	//16	//28
    (1.45 -1 -1)	//53	//5	//17	//29
    (1.4 -1 -1)	//54	//6	//18	//30
    (0 -1 -1)	//55   //7	//19	//31
    (0 -1 -2)	//56   //8	//20	//32
    (1.4 -1 -2)	//57	//9	//21	//33
    (1.45 -1 -2)	//58	//10	//22	//34
    (3.05 -1 -2)	//59 	//11	//23	//35
);

blocks
(
    hex (43 42 18 19 36 37 13 12) (7 4 10) simpleGrading (1 1 1)
    hex (44 45 21 20 43 42 18 19) (7 4 10) simpleGrading (1 1 1)
    hex (19 18 30 31 12 13 25 24) (7 8 10) simpleGrading (1 1 1)
    hex (20 21 33 32 19 18 30 31) (7 8 10) simpleGrading (1 1 1)
    hex (45 46 22 21 42 41 17 18) (4 4 10) simpleGrading (1 1 1)
    hex (21 22 34 33 18 17 29 30) (4 8 10) simpleGrading (1 1 1)
    hex (18 17 29 30 13 14 26 25) (4 8 10) simpleGrading (1 1 1)
    hex (41 40 16 17 38 39 15 14) (8 4 10) simpleGrading (1 1 1)
    hex (46 47 23 22 41 40 16 17) (8 4 10) simpleGrading (1 1 1)
    hex (17 16 28 29 14 15 27 26) (8 8 10) simpleGrading (1 1 1)
    hex (22 23 35 34 17 16 28 29) (8 8 10) simpleGrading (1 1 1)
    hex (55 54 42 43 48 49 37 36) (7 8 10) simpleGrading (1 1 1)
    hex (56 57 45 44 55 54 42 43) (7 8 10) simpleGrading (1 1 1)
    hex (53 52 40 41 50 51 39 38) (8 8 10) simpleGrading (1 1 1)
    hex (58 59 47 46 53 52 40 41) (8 8 10) simpleGrading (1 1 1)
    hex (57 58 46 45 54 53 41 42) (4 8 10) simpleGrading (1 1 1)
    hex (54 53 41 42 49 50 38 37) (4 8 10) simpleGrading (1 1 1)

);

edges
(
);

patches
(
    wall inlet
    (
        (43 36 12 19)
        (44 43 19 20)
        (19 12 24 31)
        (20 19 31 32)
        (55 48 36 43)
        (56 55 43 44)
    )
    patch outlet
    (
        (39 40 16 15)
        (40 47 23 16)
        (15 16 28 27)
        (16 23 35 28)
        (51 52 40 39)
        (52 59 47 40)
    )
    wall right
    (
        (31 24 25 30)
        (32 31 30 33)
        (29 34 33 30)
        (26 29 30 25)
        (28 35 34 29)
        (27 28 29 26)
    )
    wall left
    (
        (48 55 54 49)
        (55 56 57 54)
        (54 57 58 53)
        (53 58 59 52)
        (50 53 52 51)
	(49 54 53 50)
    )
    wall top
    (
        (20 21 45 44)
        (21 22 46 45)
        (22 23 47 46)
        (34 35 23 22)
        (33 34 22 21)
        (32 33 21 20)
        (46 47 59 58)
        (45 46 58 57)
        (44 45 57 56)
    )
    wall bottom
    (
        (36 37 13 12)
        (38 39 15 14)
        (14 15 27 26)
        (13 14 26 25)
        (12 13 25 24)
        (50 51 39 38)
        (49 50 38 37)
        (48 49 37 36)
    )
    wall interface
    (
        (37 42 18 13)
        (42 41 17 18)
        (41 38 14 17)
        (17 14 13 18)
        (38 41 42 37)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
