oscillatingElasticBeam/constant/solid/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
//Level 0	
    (1.4 -0.2 0)
    (1.45 -0.2 0)
    (1.45 -0.2 -1)
    (1.4 -0.2 -1)
//Level 1	
    (1.4 0.2 0)
    (1.45 0.2 0)
    (1.45 0.2 -1)
    (1.4 0.2 -1)
);

blocks
(
    hex (3 2 6 7 0 1 5 4) (4 8 10) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall interface
    (
        (3 0 4 7)
        (2 3 7 6)
        (1 2 6 5)
        (4 5 6 7)
	(0 3 2 1)
        
    )

    wall bottom
    (
        (0 1 5 4)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
