oscillatingElasticBeam/constant/solid/timeVsTraction
(
	( 0 (0 0 0))
	( 0.1 (80.01 0 0))
	( 3.9 (80.01 0 0))
	( 4 (0 0 0))
) 
